0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet_1
    {
//        type            slip;
        type            flowRateInletVelocity;
        massFlowRate    0.71;
        rho             rho;
        rhoInlet        1000;
    }
    inlet_2
    {
//        type            slip;
        type            flowRateInletVelocity;
        massFlowRate    2.91;
        rho             rho;
        rhoInlet        1000;
    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }

    leftWall
    {
        type            slip;
    }

    rightWall
    {
        type            slip;
    }

    lowerWall
    {
        type            slip;
    }

    atmosphere
    {
        type            slip;
    }
}


// ************************************************************************* //
