0/alpha.cp
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alpha.water;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
12029
(
0.0235
0.0235
0.0235
0.0235
0.0235
0.0235
0.0235
0.0235
...
)
;

boundaryField
{
    atmosphere
    {
        type            zeroGradient;
    }
    inlet_1
    {
        type            inletOutlet;
        inletValue      uniform 1;
        value           uniform 1;
    }
    inlet_2
    {
        type            slip;
    }
    outlet
    {
        type            slip;
    }
    lowerWall
    {
        type            zeroGradient;
    }
    rightWall
    {
        type            zeroGradient;
    }
    leftWall
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
